## Pandas Part 6: Add/Remove Rows and Columns to/from DataFrames

Corey Schafer's Pandas Part 6 [tutorial](https://www.youtube.com/watch?v=HQ6XO9eT-fc&list=PL-osiE80TeTsWmV9i9c58mdDCSskIFdDS&index=6)

In [1]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'Last': ['Schafer', 'Doe', 'Doe'],
    'email': ['CoreMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     Last                   email
0  Corey  Schafer  CoreMSchafer@gmail.com
1   Jane      Doe       JaneDoe@email.com
2   John      Doe       JohnDoe@email.com

In [6]:
# add a row:
df['first'] + ' ' + df['Last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [7]:
df['full_name'] = df['first'] + ' ' + df['Last']

In [8]:
df

   first     Last                   email      full_name
0  Corey  Schafer  CoreMSchafer@gmail.com  Corey Schafer
1   Jane      Doe       JaneDoe@email.com       Jane Doe
2   John      Doe       JohnDoe@email.com       John Doe

In [10]:
# remove columns:
# first run this command and check the output is as expected, then use inplace=True to actually apply it to the dataframe
# df.drop(columns = ['first', 'Last'])
df.drop(columns = ['first', 'Last'], inplace=True)

In [11]:
df

                    email      full_name
0  CoreMSchafer@gmail.com  Corey Schafer
1       JaneDoe@email.com       Jane Doe
2       JohnDoe@email.com       John Doe

In [12]:
# let's split the fullname back to first and last name:
df['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [13]:
# extract the first and last names from each list, use the option 'expand':
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [14]:
# set these new columns to dataframe
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [15]:
df

                    email      full_name  first     last
0  CoreMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@email.com       Jane Doe   Jane      Doe
2       JohnDoe@email.com       John Doe   John      Doe

In [17]:
# Adding a single row
df.append({'first': 'Tony'}, ignore_index=True)

                    email      full_name  first     last
0  CoreMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@email.com       Jane Doe   Jane      Doe
2       JohnDoe@email.com       John Doe   John      Doe
3                     NaN            NaN   Tony      NaN

In [18]:
people = {
    'first': ['Tony', 'Steve'],
    'last': ['Stark', 'Rogers'],
    'email': ['Ironman@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [19]:
df2

   first    last               email
0   Tony   Stark  Ironman@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [20]:
# Append dataframe df2 to df1
# Note the order of the columns of each df are different
# Note df2 doesn't have a full_name column
df.append(df2, ignore_index=True)

                    email      full_name  first     last
0  CoreMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@email.com       Jane Doe   Jane      Doe
2       JohnDoe@email.com       John Doe   John      Doe
3      Ironman@avenge.com            NaN   Tony    Stark
4          Cap@avenge.com            NaN  Steve   Rogers

In [21]:
df = df.append(df2, ignore_index=True)

In [22]:
df

                    email      full_name  first     last
0  CoreMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@email.com       Jane Doe   Jane      Doe
2       JohnDoe@email.com       John Doe   John      Doe
3      Ironman@avenge.com            NaN   Tony    Stark
4          Cap@avenge.com            NaN  Steve   Rogers

In [23]:
# let's delete the last row
# try it first like this, and if OK, apply results to dataframe using inplace=True
df.drop(index=4)

                    email      full_name  first     last
0  CoreMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@email.com       Jane Doe   Jane      Doe
2       JohnDoe@email.com       John Doe   John      Doe
3      Ironman@avenge.com            NaN   Tony    Stark

In [24]:
df.drop(index=4, inplace=True)

In [25]:
df

                    email      full_name  first     last
0  CoreMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@email.com       Jane Doe   Jane      Doe
2       JohnDoe@email.com       John Doe   John      Doe
3      Ironman@avenge.com            NaN   Tony    Stark

In [28]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                    email      full_name  first     last
0  CoreMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3      Ironman@avenge.com            NaN   Tony    Stark